In [1]:
import pandas as pd

In [2]:
data = {"Name":["Rajeev","Sakshi","Murti","Rohini","Pranita","Shivam","Sayali"],"Marks":[12,13,41,"NaN",45,"NaN",18],"Gender":["M","F","M","F","F","M","F"],"Branch":["CSE","MEC","CSE","CSE","MEC","MEC","CSE"]}

In [8]:
a = pd.DataFrame(data)
a

      Name Marks Gender Branch
0   Rajeev    12      M    CSE
1   Sakshi    13      F    MEC
2    Murti    41      M    CSE
3   Rohini   NaN      F    CSE
4  Pranita    45      F    MEC
5   Shivam   NaN      M    MEC
6   Sayali    18      F    CSE

In [9]:
a=a.replace(to_replace="NaN", value = 5)
a

      Name  Marks Gender Branch
0   Rajeev     12      M    CSE
1   Sakshi     13      F    MEC
2    Murti     41      M    CSE
3   Rohini      5      F    CSE
4  Pranita     45      F    MEC
5   Shivam      5      M    MEC
6   Sayali     18      F    CSE

In [5]:
c=avg=0
for ele in a["Marks"]:
    if str(ele).isnumeric():
        c+=1
        avg+=ele
avg/=c

In [13]:
a["Gender"]=a["Gender"].map({"M":0,"F":1})

In [14]:
a=a.replace(to_replace=18, value = avg)
a

      Name      Marks  Gender Branch
0   Rajeev  12.000000       0    CSE
1   Sakshi  13.000000       1    MEC
2    Murti  41.000000       0    CSE
3   Rohini   5.000000       1    CSE
4  Pranita  45.000000       1    MEC
5   Shivam   5.000000       0    MEC
6   Sayali  19.857143       1    CSE

In [12]:
print(a["Marks"]>13)

0    False
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [15]:
Fees_Data = {"Name":["Rajeev","Sakshi","Murti","Rohini"],"Fees":["Nill","Pending","Nill","Pending"]}

In [16]:
b = pd.DataFrame(Fees_Data)

In [17]:
c = pd.merge(a,b,on="Name")

In [18]:
c

     Name  Marks  Gender Branch     Fees
0  Rajeev   12.0       0    CSE     Nill
1  Sakshi   13.0       1    MEC  Pending
2   Murti   41.0       0    CSE     Nill
3  Rohini    5.0       1    CSE  Pending

In [20]:
d = a.groupby("Branch")
d.get_group("CSE")

     Name      Marks  Gender Branch
0  Rajeev  12.000000       0    CSE
2   Murti  41.000000       0    CSE
3  Rohini   5.000000       1    CSE
6  Sayali  19.857143       1    CSE

In [25]:
Non_Dup = a[~a.duplicated("Gender")]

In [26]:
Non_Dup

     Name  Marks  Gender Branch
0  Rajeev   12.0       0    CSE
1  Sakshi   13.0       1    MEC